---
kind: method
id: M:Autodesk.Revit.DB.DefinitionBindingMap.Clear
source: html/dbeb3b98-1536-d791-f0e0-a8448c765f4c.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.Clear Method

Removes every binding from the map, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```